function f=CowellJ2(t,arrow)
x=arrow(1);
y=arrow(2);
z=arrow(3);
vx=arrow(4);
vy=arrow(5);
vz=arrow(6);
%常参数
miu=3.986e5;%km
Re=6378.140;%km
J2=0.001082626173852;%EGM2008模型使用的J2数值
%J2=0;%无摄动

%外力
fx=(miu*((3*J2*Re^2*x*z^2)/(x^2 + y^2 + z^2)^3 + (J2*Re^2*x*((3*z^2)/(x^2 + y^2 + z^2) - 1))/(x^2 + y^2 + z^2)^2))/(x^2 + y^2 + z^2)^(1/2) + (miu*x*((J2*((3*z^2)/(x^2 + y^2 + z^2) - 1)*Re^2)/(2*x^2 + 2*y^2 + 2*z^2) - 1))/(x^2 + y^2 + z^2)^(3/2);
fy=(miu*((3*J2*Re^2*y*z^2)/(x^2 + y^2 + z^2)^3 + (J2*Re^2*y*((3*z^2)/(x^2 + y^2 + z^2) - 1))/(x^2 + y^2 + z^2)^2))/(x^2 + y^2 + z^2)^(1/2) + (miu*y*((J2*((3*z^2)/(x^2 + y^2 + z^2) - 1)*Re^2)/(2*x^2 + 2*y^2 + 2*z^2) - 1))/(x^2 + y^2 + z^2)^(3/2);
fz=(miu*z*((J2*((3*z^2)/(x^2 + y^2 + z^2) - 1)*Re^2)/(2*x^2 + 2*y^2 + 2*z^2) - 1))/(x^2 + y^2 + z^2)^(3/2) - (miu*((J2*Re^2*((6*z)/(x^2 + y^2 + z^2) - (6*z^3)/(x^2 + y^2 + z^2)^2))/(2*(x^2 + y^2 + z^2)) - (J2*Re^2*z*((3*z^2)/(x^2 + y^2 + z^2) - 1))/(x^2 + y^2 + z^2)^2))/(x^2 + y^2 + z^2)^(1/2);
%6个表达式
Dx=vx;
Dy=vy;
Dz=vz;
Dvx=fx;
Dvy=fy;
Dvz=fz;


f=[Dx;Dy;Dz;Dvx;Dvy;Dvz;];
end